module.exports = {
  // =====================
  // COMMUNITY BOT
  // =====================

  // השם שמופיע בתוך הפאנלים.
  // את שם הבוט עצמו משנים ב־Discord Developer Portal.
  botName:
    "OM Bazaar MAIN | BOT",

  clientId:
    "1556663410677125152",

  guildId:
    "1492902342171955291",

  // =====================
  // ROLES
  // =====================

  memberRoleId:
    "1554818160845135943",

  // צוות שמטפל בטיקטים וב־!h
  staffRoleId:
    "1554859070236795001",

  // רק הרול הזה + Admin יכולים להשתמש במודרציה וב־Setup Verify
  managementRoleId:
    "1554857341093023904",

  // =====================
  // VERIFY
  // =====================

  // תכניס כאן את ה־IDs של החדרים שבהם Members כן יכולים לכתוב.
  // כל שאר החדרים הציבוריים יהיו Members Only אבל Read Only.
  //
  // חדרי Staff שכבר פרטיים לא נפתחים.
  verifyWritableChannelIds: [
    "1554813619798024212",
    "1554463647223517205",
    "1556318612652957826",
    "1555959268132266015",
    "1554813787918303352",
    "1554867611756535808",
    "1554813850556178515",
    "1554820789776285757"
  ],

  // =====================
  // TICKETS
  // =====================

  ticketCategoryId:
    "1492902343371657228",

  ticketLogsChannelId:
    "1554463647223517208"
};
